/****************************************************************************

  (c) SYSTEC electronic GmbH, D-07973 Greiz, August-Bebel-Str. 29
      www.systec-electronic.com

  Project:      CANopen V5

  Description:  Header file for CANopen API

  -------------------------------------------------------------------------

                $RCSfile: Cop.h,v $

                $Author: R.Dietzsch $

                $Revision: 1.153 $  $Date: 2007/01/08 13:53:32 $

                $State: Exp $

                Build Environment:
                    all

  -------------------------------------------------------------------------

  Revision History:
  2003/12/11 f.j.:  neue Struktur tObdVStringDef definiert, die bei der
                        Anlage von Strings im RAM benoetigt wird, um die
                        Werte fuer die Zeiger auf die RAM Daten richtig
                        vorinitialisieren zu koennen

  2004/10/06 f.j.:  include configuration manager

  2004/11/15 a.s.:  Function CcmStoreCheckArchivState() added

  2004/12/07 r.d.:  Defines kObdPart... replaced from obd.h to cop.h.
  2004/12/07 r.d.:  Defines kObdEv...   replaced from obd.h to cop.h.
  2005/05/19 m.b.:  SRDO module included
  2005/12/13 k.t.:  Add SDO Manager and SRD Client Modul
  2005/12/22 k.t.:  take not needed structures to ccmmain.h
  2005/12/22 k.t.:  Add kSrdEventCopError in tSrdEvent

****************************************************************************/

#ifndef _COP_H_

#define CCM_MODULE_PDO          0x00000100L // PDO module
#define CCM_MODULE_SRDO         0x00000400L // SRDO module (safety relevant data objects)
#define CCM_MODULE_DR303_3      0x00000800L // CiA DR303-3 (Indicator Specification)
#define CCM_MODULE_COPMGR       0x00001000L // CANopen Manager according to CiA 302
#define CCM_MODULE_SDOM         0x00002000L // SDO Manager module
#define CCM_MODULE_SRD          0x00004000L // SRD Client module
#define CCM_MODULE_CFGMA        0x00008000L // Configuration Manager
#define CCM_MODULE_CFGMASYS     0x00010000L // Configuration Manager with extended
                                            // SYSTEC concise format
#define CCM_MODULE_FLYMA        0x00020000L // Flying Master
#define CCM_MODULE_SDOGWY       0x00040000L // SDO Gateway


// 13.05.2004 r.d.: standard CANopen does not work with "../include/..."
//#include "../include/copcfg.h"     // CANopen configuration file (configuration from application)
#if defined(AW_COM_CANOPEN_MST)
#include "cop_mst/copcfg.h"     // CANopen configuration file (configuration from application)
#elif defined(AW_COM_CANOPEN_SLV)
#include "cop_slv/copcfg.h"     // CANopen configuration file (configuration from application)
#else
#error "must define AW_COM_CANOPEN_MST or AW_COM_CANOPEN_SLV at project"
#endif
//#include "copcfg.h"   // CANopen configuration file (configuration from application)
#include "copdef.h"     // CANopen configuration file (default configuration)
#include "instdef.h"    // defines macros for instance types and table
#include "debug.h"      // debug definitions

#include "errordef.h"   // CANopen error codes for API funtions
#include "sdoac.h"      // CANopen abort codes for SDO
// needed, because Paradigm C used own target.h for Beck-Chip 1x3
#if (DEV_SYSTEM == _DEV_PAR_BECK1X3_)
  //  #include "../../../../include/target.h"   // target specific functions and definitions
#else
   // #include "target.h"     // target specific functions and definitions
#endif

#include "cdrvinc.h"    // interface files for CAN driver selection and access

#ifdef PXROS

    #include "tgtpxtsk.h"

#endif // PXROS


// ============================================================================
// types and prototypes for several modules
// ============================================================================

#define INFINITE_TIME                   -1


// ============================================================================
// COB specific defines, typedefs
// ============================================================================

#define CANID_INVALID                   0x80000000L // sign an COBID to invalid
#define CAN_FRAME_FORMAT_MASK           0x20000000L // Bit 29 = 0: 11Bit ID, 1 = 29BitID
#define CANID_SYNC_PRODUCER             0x40000000L


// ----------------------------------------------------------------------------
// This structure defines function pointers to CAN driver functions.
// Interface of these functions from all CAN drivers are the same
// with equal configurations.
typedef struct
{                                                   // $$$ Sollten unbenutzte Einträge nicht wegfallen?
    tCdrvInit               m_fpInit;               // used
    tCdrvAddInstance        m_fpAddInstance;        // used
    tCdrvDeleteInstance     m_fpDeleteInstance;     // used
    tCdrvSetBaudrate        m_fpSetBaudrate;        // used
    tCdrvReset              m_fpReset;              // used
    tCdrvDefineCanId        m_fpDefineCanId;        // used
    tCdrvUndefineCanId      m_fpUndefineCanId;      // used
    tCdrvWriteMsg           m_fpWriteMsg;           // used
    tCdrvReadMsg            m_fpReadMsg;            // used
    tCdrvReleaseMsg         m_fpReleaseMsg;         // used
    tCdrvUpdateMsg          m_fpUpdateMsg;          // used
    tCdrvInterruptHandler   m_fpInterruptHandler;   // n.u.
    tCdrvGetStatus          m_fpGetStatus;          // used
    tCdrvResetStatus        m_fpResetStatus;        // used
    tCdrvGetDiagnostic      m_fpGetDiagnostic;      // n.u.
    tCdrvClearRtr           m_fpClearRtr;           // used

} tCobCdrvFct;


// -------------------------------------------------------------------------
// type for index of COB entry table
// -------------------------------------------------------------------------
// Note:
// If there are less than 255 communication objects (COB) tCobEntryIndex should
// be defined to BYTE! Typedef should be dependant from a define (to be defined).
#if (COB_MORE_THAN_128_ENTRIES == FALSE)
    typedef BYTE tCobEntryIndex;
#else
    typedef WORD tCobEntryIndex;
#endif


// ============================================================================
// OBD specific defines, typedefs
// ============================================================================

// part of OD (bit oriented)
typedef tFastByte tObdPart;

#define kObdPartNo          0x00    // nothing
#define kObdPartGen         0x01    // generic part      (0x1000 - 0x1FFF)
#define kObdPartMan         0x02    // manufacturer part (0x2000 - 0x5FFF)
#define kObdPartDev         0x04    // device part       (0x6000 - 0x9FFF)
#define kObdPartUsr         0x08    // dynamic part e.g. for ICE61131-3

// combinations
#define kObdPartApp         (                            kObdPartDev              )   // application part (0x6000 - 0x9FFF) // 21.07.2006 r.d.: cahnged because definition in DS-301 (object 0x1010)
#define kObdPartApp2        (              kObdPartMan | kObdPartDev | kObdPartUsr)   // manufacturer and device part (0x2000 - 0x9FFF) and user OD
#define kObdPartAll         (kObdPartGen | kObdPartMan | kObdPartDev | kObdPartUsr)   // whole OD


//-----------------------------------------------------------------------------------------------------------
// events of object callback function
typedef tFastByte tObdEvent;
//                                                                                                      m_pArg points to
//                                                                                                    ---------------------
#define kObdEvCheckExist            0x06    // checking if object does exist (reading and writing)      NULL
#define kObdEvPreRead               0x00    // previous reading an object                               source data in OD
#define kObdEvPostRead              0x01    // after reading an object                                  destination data from caller
#define kObdEvWrStringDomain        0x07    // event for changing string/domain data pointer or size    struct tObdVStringDomain in RAM
#define kObdEvInitWrite             0x04    // initializes writing an object (checking object size)     size of object in OD
#define kObdEvPreWrite              0x02    // previos writing an object                                source data from caller
#define kObdEvPostWrite             0x03    // after eriting an object                                  destination data in OD
#define kObdEvAbortSdo              0x05    // after an abort of an SDO transfer                        ???


// -------------------------------------------------------------------------
// type for count of bytes in an object of object dictionary (OD)
// This type depends on application requirements.
// -------------------------------------------------------------------------

#define OBD_OBJ_SIZE_SMALL          0x00
#define OBD_OBJ_SIZE_MIDDLE         0x01
#define OBD_OBJ_SIZE_BIG            0x02

#if (OBD_SUPPORTED_OBJ_SIZE == OBD_OBJ_SIZE_SMALL)

    typedef BYTE  tObdSize; // All objects are smaller than 256 bytes.

#elif (OBD_SUPPORTED_OBJ_SIZE == OBD_OBJ_SIZE_MIDDLE)

    typedef WORD  tObdSize;   // All objects are smaller than 65535 Bytes.

#elif (OBD_SUPPORTED_OBJ_SIZE == OBD_OBJ_SIZE_BIG)

    typedef DWORD tObdSize; // For all objects as objects size are used an DWORD.

#else

    #error 'ERROR: unsupported value for object size (OBD_SUPPORTED_OBJ_SIZE)!'

#endif

// -------------------------------------------------------------------------
// types for data types defined in DS301
// -------------------------------------------------------------------------

// types of objects in object dictionary
// DS-301 defines these types as WORD
typedef WORD tObdType;

// types which are always supported
#define kObdTypBool         0x0001  // supported since V5.27 with PDO_USE_BIT_MAPPING = TRUE

#define kObdTypInt8         0x0002
#define kObdTypInt16        0x0003
#define kObdTypInt32        0x0004
#define kObdTypUInt8        0x0005
#define kObdTypUInt16       0x0006
#define kObdTypUInt32       0x0007
#define kObdTypReal32       0x0008
#define kObdTypVString      0x0009
#define kObdTypDomain       0x000F

#define kObdTypInt24        0x0010  // \ supported since V5.27 (always)
#define kObdTypUInt24       0x0016  // /

#define kObdTypReal64       0x0011  // \ .
#define kObdTypInt40        0x0012  // |
#define kObdTypInt48        0x0013  // |
#define kObdTypInt56        0x0014  // |
#define kObdTypInt64        0x0015  // > supported since V5.27 with define USE_VAR64
#define kObdTypUInt40       0x0018  // |
#define kObdTypUInt48       0x0019  // |
#define kObdTypUInt56       0x001A  // |
#define kObdTypUInt64       0x001B  // |
#define kObdTypTimeOfDay    0x000C  // |
#define kObdTypTimeDiff     0x000D  // /

// types which are not supported
#define kObdTypOString      0x000A
#define kObdTypUString      0x000B

// other types are not supported in this version


// -------------------------------------------------------------------------
// types for data types defined in DS301
// -------------------------------------------------------------------------

typedef unsigned char       tObdBoolean;      // 0001
typedef signed char         tObdInteger8;     // 0002
typedef signed short int    tObdInteger16;    // 0003
typedef signed long         tObdInteger32;    // 0004
typedef unsigned char       tObdUnsigned8;    // 0005
typedef unsigned short int  tObdUnsigned16;   // 0006
typedef unsigned long       tObdUnsigned32;   // 0007
typedef float               tObdReal32;       // 0008


typedef struct
{
   tObdSize         m_Size;
   char GENERIC*    m_pString;

} tObdVString;                          // 000D

#if (OBD_USE_STRING_DOMAIN_IN_RAM != FALSE)
// r.d.: if there are warnings in objdict.c then set this define in CopCfg.h to TRUE

    //f.j. default string in CONST
    typedef struct
    {
       tObdSize         m_Size;
       char GENERIC*    m_pDefString;
       char GENERIC*    m_pString;

    } tObdVStringDef;                       // ???

#endif

//r.d. parameter struct for changing object size and/or pointer to data of Strings or Domains
typedef struct
{
   tObdSize         m_DownloadSize;     // download size from SDO or APP
   tObdSize         m_ObjSize;          // current object size from OD - should be changed from callback function
   void GENERIC*    m_pData;            // current object ptr  from OD - should be changed from callback function

} tObdVStringDomain;                          // 000D

/*
typedef struct
{
   tObdSize         m_Size;
   char GENERIC*    m_pString;

} tObdOString;                          // 000C

typedef struct
{
   tObdSize              m_Size;
   short int GENERIC*    m_pString;

} tObdUString;                          // 000B
*/

//typedef ...           tObdBitString;    // 000E  ???
typedef unsigned char   tObdDomain;       // 000F
typedef signed   long   tObdInteger24;    // 0010
typedef unsigned long   tObdUnsigned24;   // 0016


#ifdef USE_VAR64

typedef signed QWORD    tObdInteger40;    // 0012
typedef signed QWORD    tObdInteger48;    // 0013
typedef signed QWORD    tObdInteger56;    // 0014
typedef signed QWORD    tObdInteger64;    // 0015

typedef unsigned QWORD  tObdUnsigned40;   // 0018
typedef unsigned QWORD  tObdUnsigned48;   // 0019
typedef unsigned QWORD  tObdUnsigned56;   // 001A
typedef unsigned QWORD  tObdUnsigned64;   // 001B

typedef double          tObdReal64;       // 0011

#ifndef _TIME_OF_DAY_DEFINED_
    #error 'ERROR: Declaration of tTimeOfDay in Global.h is missing!'
#endif

typedef tTimeOfDay tObdTimeOfDay;         // 000C
typedef tTimeOfDay tObdTimeDifference;    // 000D

#endif // USE_VAR64


// -------------------------------------------------------------------------
// structur for a variable in OD
// -------------------------------------------------------------------------

//-------------------------------------------------------------------------

typedef tCopKernel (PUBLIC ROM* tVarCallback) (CCM_DECL_INSTANCE_HDL_
    void GENERIC* pParam_p);

typedef struct
{
    void MEM*           m_pData;
    tObdSize            m_Size;

    #if (PDO_USE_STATIC_MAPPING == FALSE)
        tVarCallback    m_fpCallback;
        void GENERIC*   m_pArg;
    #endif

} tObdVarEntry;


// -------------------------------------------------------------------------
typedef tFastByte tVarParamValid;

#define kVarValidSize           0x01
#define kVarValidData           0x02
#define kVarValidCallback       0x04
#define kVarValidArg            0x08

#define kVarValidAll            0x0F


